// Пользователь вводит с клавиатуры M чисел. Посчитайте, сколько чисел больше 0 ввёл пользователь.
/*
int[] CreateArray (int size)
{
    int[] array = new int[size];

for (int i = 0; i < array.Length; i++)
{
    array[i] = new Random().Next(-20, 20);

}
    return array;
}


void ShowArray(int [] array)
{
    for ( int i = 0; i < array.Length; i++)
        Console.Write(array[i]+" ");
    Console.WriteLine();
}

int NumPozitive( int []array)
{
    int count =0;
    for(int i = 0; i < array.Length;i++)
    {
        if(array[i]>0) count++;
    }
    return count;
}

Console.Write("Input a size:  ");
int size = Convert.ToInt32(Console.ReadLine());

int [] myArray = CreateArray(size);
ShowArray(myArray);
int pozitiveNum = NumPozitive(myArray);
Console.WriteLine("Pozitive number in array is " +pozitiveNum);
*/
//Напишите программу, которая найдёт точку пересечения двух прямых, заданных уравнениями y = k1 * x + b1, y = k2 * x + b2; значения b1, k1, b2 и k2 задаются пользователем.

